"""Создать собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел. Проверить
работу исключения на реальном примере. Запрашивать у пользователя данные и заполнять список необходимо только числами.
Класс-исключение должен контролировать типы данных элементов списка.
Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу
скрипта, введя, например, команду «stop». При этом скрипт завершается, сформированный список с числами выводится на
экран.
Подсказка: для этого задания примем, что пользователь может вводить только числа и строки. Во время ввода пользователем
очередного элемента необходимо реализовать проверку типа элемента. Вносить его в список, только если введено число.
Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
При этом работа скрипта не должна завершаться.


"""


class MyOwnErr(Exception):
    def __init__(self, txt):
        self.txt = txt


my_list = []
stop_word = 'Stop'
while True:
    num = input('Pls enter a number that we"ll add in list (enter "Stop" when you finish): ')
    if num == stop_word:
        break
    number = int(num)
    try:
        my_list.append(number)
        if type(number) != int:
            raise MyOwnErr('F')
    except (ValueError, MyOwnErr) as err:
        print(f'{err}')
print(my_list)